### Shared environment
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
random_uuid.superadministrator_role_id: Refreshing state... [id=3c10414e-3a36-c728-52fe-3f5fa87d4fd1]
random_uuid.api_access_as_user: Refreshing state... [id=82728a37-6e51-8699-3323-ddc404d0fe13]
random_uuid.administrator_role_id: Refreshing state... [id=5ef08613-a32b-d3ef-fa1d-926bc7801dc2]
data.azuread_application_published_app_ids.well_known: Reading...
azuread_application_registration.web: Refreshing state... [id=/applications/4dc1ecb4-fb24-4419-bc8c-64b15338b47e]
azuread_application_registration.api: Refreshing state... [id=/applications/148fcf27-f238-4b56-bf22-af0906b3f070]
data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
data.azuread_service_principal.msgraph: Reading...
azuread_application_identifier_uri.api: Refreshing state... [id=/applications/148fcf27-f238-4b56-bf22-af0906b3f070/identifierUris/YXBpOi8vNzU3YjQ5YzgtMzMwNS00ZDg1LWIzY2QtY2RkYWUxZjYxNWNm]
azuread_application_permission_scope.api_access_as_user: Refreshing state... [id=/applications/148fcf27-f238-4b56-bf22-af0906b3f070/permissionScopes/82728a37-6e51-8699-3323-ddc404d0fe13]
azuread_application_app_role.api_superadministrator: Refreshing state... [id=/applications/148fcf27-f238-4b56-bf22-af0906b3f070/appRoles/3c10414e-3a36-c728-52fe-3f5fa87d4fd1]
azuread_application_app_role.api_administrator: Refreshing state... [id=/applications/148fcf27-f238-4b56-bf22-af0906b3f070/appRoles/5ef08613-a32b-d3ef-fa1d-926bc7801dc2]
azuread_service_principal.api: Refreshing state... [id=/servicePrincipals/7f571a01-5c51-42f8-aefd-040416f5845a]
azuread_application_redirect_uris.web: Refreshing state... [id=/applications/4dc1ecb4-fb24-4419-bc8c-64b15338b47e/redirectUris/SPA]
azuread_service_principal.web: Refreshing state... [id=/servicePrincipals/febd01e6-38ac-48b4-ad27-8dcb216ea6b6]
azuread_application_api_access.web_api: Refreshing state... [id=/applications/4dc1ecb4-fb24-4419-bc8c-64b15338b47e/apiAccess/757b49c8-3305-4d85-b3cd-cddae1f615cf]
data.azuread_service_principal.msgraph: Read complete after 2s [id=/servicePrincipals/cb86be44-f8dd-45b1-a3cd-70f5a88e8b96]
azuread_application_api_access.api: Refreshing state... [id=/applications/148fcf27-f238-4b56-bf22-af0906b3f070/apiAccess/00000003-0000-0000-c000-000000000000]
azuread_application_api_access.web_graph: Refreshing state... [id=/applications/4dc1ecb4-fb24-4419-bc8c-64b15338b47e/apiAccess/00000003-0000-0000-c000-000000000000]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01MWNmMDJmYi00Mjc3LTQ3NWQtOGYxNC05MTg3ZjY4YTI4NzM7b2JqZWN0SWQ9NDQzM2MyOWEtMDE0NS00ZjI4LTkzY2YtMTZiY2RkMzhiZmViO3N1YnNjcmlwdGlvbklkPTE2ZTAxYTAwLWY4MjUtNGM5Ni04YWUyLWU2OGNiNTJjZjY1Mzt0ZW5hbnRJZD1mZmFiMzhkZi1jZGRmLTQzM2YtODU5YS02Y2ZhMTYxYTVjZWI=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_registry.main will be created
  + resource "azurerm_container_registry" "main" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + data_endpoint_host_names      = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + login_server                  = (known after apply)
      + name                          = "crtshortwesteurope001"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-tshort-shared-westeurope-001"
      + sku                           = "Basic"
      + tags                          = {
          + "environment" = "Shared"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-tshort-shared-westeurope-001"
      + tags     = {
          + "environment" = "Shared"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

</details>